dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
#if defined( STM32F103xB )
    InitUartPins( GPIOA, 9, GPIOA, 10, 0 );
#elif defined( STM32F107xC )
    InitUartPins( GPIOA, 9, GPIOA, 10 );
#error no hardware to verify yet
#elif defined( STM32F407xx )
    InitUartPins( GPIOA, 9, GPIOA, 10, GPIO_AF7_USART1 );  // to verify
#else
#error InitUSART1_PA9PA10(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( USART1 );
    InitUartSettings( USART1, baud_rate, len, parity, stop_b );

    InitUartNvic( USART1_IRQn );

    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART1_PA9PA10  && defined( USART1_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART1_PB6PB7 ) && defined( USART1_EXISTS )
static void InitUSART1_PB6PB7( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {

#if defined( STM32F107xC )
    InitUartPins( GPIOB, 6, GPIOB, 7 );
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART1_ENABLE();
#else
#error InitUSART1_PB6PB7(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( USART1 );
    InitUartSettings( USART1, baud_rate, len, parity, stop_b );

    InitUartNvic( USART1_IRQn );

    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART1_PA9PA10

// ---------------------------------------------------------------------------
#if defined( _CONSOLE_USE_UART1_PA9PA10 ) \
    || defined( _CONSOLE_USE_UART1_PB6PB7 )
#if defined( USART1_EXISTS )
void USART1_IRQHandler( void ) {
#if defined( STM32F107xC )
    ConsoleUartIRQ();
#else
#error USART1_IRQHandler(): need to implement and verify!
#endif
}
#endif
#endif  // _CONSOLE_USE_UART1_PA9PA10 || _CONSOLE_USE_UART1_PB6PB7

// ============================================================================
#if defined( _CONSOLE_USE_UART2_PA2PA3 ) && defined( USART2_EXISTS )
static void InitUSART2_PA2PA3( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {

#if defined( STM32F030x8 )
    InitUartPins( GPIOA, 2, GPIOA, 3, GPIO_AF1_USART2 );  // verified
#elif defined( STM32F103xB )
    InitUartPins( GPIOA, 2, GPIOA, 3 );                   // verified
#elif defined( STM32F107xC )
    InitUartPins( GPIOA, 2, GPIOA, 3 );                    // verified
#elif defined( STM32F407xx )
    InitUartPins( GPIOA, 2, GPIOA, 3, GPIO_AF7_USART2 );  // verified
#else
#error InitUSART2_PA2PA3(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( USART2 );
    InitUartSettings( USART2, baud_rate, len, parity, stop_b );

    InitUartNvic( USART2_IRQn );

    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART2_PA2PA3 && defined( USART2_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART2_PD5PD6 ) && defined( USART2_EXISTS )
// TODO
// STM32F107VCT6 does not have USART2 on these pins
static void InitUSART2_PD5PD6( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {

#if defined( STM32F107xC )
    InitUartPins( GPIOD, 5, GPIOD, 6 );  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART2_ENABLE();
#else
#error InitUSART2_PD5PD6(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( USART2 );
    InitUartSettings( USART2, baud_rate, len, parity, stop_b );

    // these may work only for F103, F107, etc, will fix

    InitUartNvic( USART2_IRQn );

    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART2_PD5PD6 && defined( USART2_EXISTS )

// ---------------------------------------------------------------------------
#if defined( _CONSOLE_USE_UART2_PA2PA3 ) || defined( _CONSOLE_USE_UART2_PD5PD6 )
#if defined( USART2_EXISTS )
void USART2_IRQHandler( void ) {

// STM32F030x8 is verified
// STM32F103xB is verified
// STM32F107xC is verified
#if defined( STM32F030x8 ) || defined( STM32F103xB ) || defined( STM32F107xC ) \
    || defined( STM32F407xx )
    ConsoleUartIRQ();
#else
#error USART2_IRQHandler(): need to implement and verify!
#endif
}
#endif
#endif  // _CONSOLE_USE_UART2_PA2PA3 || _CONSOLE_USE_UART2_PD5PD6

// ============================================================================
#if defined( _CONSOLE_USE_UART3_PB10PB11 ) && defined( USART3_EXISTS )
static void InitUSART3_PB10PB11( uint32_t baud_rate, uint8_t len, char parity,
                                 uint8_t stop_b ) {

#if defined( STM32F107xC )
    InitUartPins( GPIOB, 10, GPIOB, 11 );  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
#else
#error InitUSART3_PB10PB11(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( USART3 );
    InitUartSettings( USART3, baud_rate, len, parity, stop_b );

    // these may work only for F103, F107, etc, will fix
    InitUartNvic( USART3_IRQn );

    // __HAL_USART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART3_PB10PB11 && defined( USART3_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART3_PC10PC11 ) && defined( USART3_EXISTS )
static void InitUSART3_PC10PC11( uint32_t baud_rate, uint8_t len, char parity,
                                 uint8_t stop_b ) {

#if defined( STM32F107xC )
    InitUartPins( GPIOC, 10, GPIOC, 11 );  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART3_PARTIAL();
#else
#error InitUSART3_PC10PC11(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( USART3 );
    InitUartSettings( USART3, baud_rate, len, parity, stop_b );

    InitUartNvic( USART3_IRQn );

    // __HAL_USART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART3_PC10PC11 && defined( USART3_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART3_PD8PD9 ) && defined( USART3_EXISTS )
static void InitUSART3_PD8PD9( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {

#if defined( STM32F107xC )
    InitUartPins( GPIOD, 8, GPIOD, 9 );  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART3_ENABLE();
#elif defined( STM32F746xx ) || defined( STM32F767xx )
    InitUartPins( GPIOD, 8, GPIOD, 9, GPIO_AF7_USART3 );  // verified
#else
#error InitUSART3_PD8PD9(): need to implement and verify!
#endif

    // usart setting
    utils.clock.enableUart( USART3 );
    InitUartSettings( USART3, baud_rate, len, parity, stop_b );

    InitUartNvic( USART3_IRQn );

