dj-zhou/one-third-hal-stm32/one-third-hal/core/uart-console.c
    // __HAL_UART_ENABLE( &hconsole_ );
}
#endif  // _CONSOLE_USE_UART3_PD8PD9 && defined( USART3_EXISTS )

// ---------------------------------------------------------------------------
#if defined( _CONSOLE_USE_UART3_PB10PB11 )    \
    || defined( _CONSOLE_USE_UART3_PC10PC11 ) \
    || defined( _CONSOLE_USE_UART3_PD8PD9 )
#if defined( USART3_EXISTS )
void USART3_IRQHandler( void ) {
#if defined( STM32F107xC )
    ConsoleUartIRQ();
#elif defined( STM32F746xx )
    ConsoleUartIRQ();
#elif defined( STM32F767xx )
    ConsoleUartIRQ();
#else
#error USART3_IRQHandler(): need to implement and verify!
#endif
}
#endif
#endif  // _CONSOLE_USE_UART3_PB10PB11 || _CONSOLE_USE_UART3_PC10PC11 ||
        // _CONSOLE_USE_UART3_PD8PD9

// ============================================================================
#if defined( _CONSOLE_USE_UART4_PC10PC11 ) && defined( UART4_EXISTS )
static void InitUART4_PC10PC11( uint32_t baud_rate, uint8_t len, char parity,
                                uint8_t stop_b ) {

#if defined( STM32F107xC )
    InitUartPins( GPIOC, 10, GPIOC, 11 );  // verified
    __HAL_RCC_AFIO_CLK_ENABLE();
#else
#error InitUART4_PC10PC11(): need to implement and verify!
#endif

    // usart setting
    utils.clock.enableUart( UART4 );
    InitUartSettings( UART4, baud_rate, len, parity, stop_b );

    // these may work only for F103, F107, etc, will fix

    InitUartNvic( UART4_IRQn );
}

// ---------------------------------------------------------------------------
void UART4_IRQHandler( void ) {
#if defined( STM32F107xC )
    ConsoleUartIRQ();
#else
#error UART4_IRQHandler(): need to implement and verify!
#endif
}
#endif  // _CONSOLE_USE_UART4_PC10PC11 && defined( UART4_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART5_PC12PD2 ) && defined( UART5_EXISTS )

// ---------------------------------------------------------------------------
// UART5 test on PC12 (TX) & PD2 (RX)
// supported baud rate: 115200, 230400, 460800, 576000, 921600
static void InitUART5_PC12PD2( uint32_t baud_rate, uint8_t len, char parity,
                               uint8_t stop_b ) {

#if defined( STM32F107xC )
    InitUartPins( GPIOC, 12, GPIOD, 2 );  // verified
#else
#error InitUART5_PC12PD2(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( UART5 );
    InitUartSettings( UART5, baud_rate, len, parity, stop_b );

    InitUartNvic( UART5_IRQn );
}

// ---------------------------------------------------------------------------
void UART5_IRQHandler( void ) {
#if defined( STM32F107xC )
    ConsoleUartIRQ();
#else
#error UART5_IRQHandler(): need to implement and verify!
#endif
}
#endif  // _CONSOLE_USE_UART5_PC12PD2 && defined( UART5_EXISTS )

// ============================================================================
#if defined( _CONSOLE_USE_UART7_PE8PE7 ) && defined( UART7_EXISTS )
static void InitUART7_PE8PE7( uint32_t baud_rate, uint8_t len, char parity,
                              uint8_t stop_b ) {

#if defined( STM32F427xx )
    InitUartPins( GPIOE, 8, GPIOE, 7, GPIO_AF8_UART7 );  // verified
#else
#error InitUART7_PE8PE7(): need to implement and verify!
#endif
    // usart setting
    utils.clock.enableUart( UART7 );
    InitUartSettings( UART7, baud_rate, len, parity, stop_b );

    InitUartNvic( UART7_IRQn );
}

// ---------------------------------------------------------------------------
void UART7_IRQHandler( void ) {
#if defined( STM32F427xx )
    ConsoleUartIRQ();
#else
#error UART7_IRQHandler(): need to implement and verify!
#endif
}
#endif  // _CONSOLE_USE_UART7_PE8PE7 && defined( UART7_EXISTS )

// ============================================================================
extern void ConsolePrintf( char* sign_data, char* format, va_list ap );

// ============================================================================
static void one_third_printk( LogLevel_e level, char* format, ... ) {
    if ( level <= console.level ) {
        char    sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start( ap, format );
        ConsolePrintf( sign_data, format, ap );
        va_end( ap );
    }
}

// ============================================================================
static void one_third_printf( char* format, ... ) {
    if ( LOG_INFO <= console.level ) {
        char    sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start( ap, format );
        ConsolePrintf( sign_data, format, ap );
        va_end( ap );
    }
}

// ============================================================================
static void consoleError( char* format, ... ) {
    if ( LOG_INFO <= console.level ) {
        char    sign_data[_CONSOLE_SIGN_DATA_SIZE];
        va_list ap;
        va_start( ap, format );
        while ( 1 ) {
            ConsolePrintf( sign_data, format, ap );
            // just some delay
            for ( int i = 0; i < 3000; i++ ) {
                for ( int j = 0; j < 3000; j++ ) {
                    ;
                }
            }
        }
        va_end( ap );
    }
}

// ============================================================================
static char consoleGetChar( uint16_t time ) {
    char read_char;
    do {
        if ( rb.r_ptr != rb.w_ptr ) {
            read_char = *rb.r_ptr;
            if ( ++rb.r_ptr == ( rb.buffer + _CONSOLE_BUFF_LEN ) ) {
                rb.r_ptr = rb.buffer;
            }
            return read_char;
        }
    } while ( time-- != 0 );

    return 0;
}

// ============================================================================
static void consoleSetLevel( LogLevel_e l ) {
    console.level = l;
}

// ============================================================================
static void ConsoleSetChar( uint8_t* buf, uint32_t len ) {
    do {
        if ( rb.w_ptr >= rb.r_ptr ) {
            if ( rb.w_ptr + len <= ( rb.buffer + _CONSOLE_BUFF_LEN ) ) {
                strncpy( rb.w_ptr, ( char* )buf, ( uint16_t )len );
                rb.w_ptr = rb.w_ptr + len;
                buf      = buf + len;
                len      = 0;
                if ( rb.w_ptr == ( rb.buffer + _CONSOLE_BUFF_LEN ) ) {
                    rb.w_ptr = rb.buffer;
                }
            }
            else {
                strncpy( rb.w_ptr, ( char* )buf,
                         ( uint16_t )( ( rb.buffer + _CONSOLE_BUFF_LEN )
                                       - rb.w_ptr ) );
                buf      = buf + ( rb.buffer + _CONSOLE_BUFF_LEN - rb.w_ptr );
                len      = len - ( rb.buffer + _CONSOLE_BUFF_LEN - rb.w_ptr );
                rb.w_ptr = rb.buffer;
            }
        }
        else {
            if ( ( ( rb.r_ptr - 1 ) - rb.w_ptr ) >= len ) {
                strncpy( rb.w_ptr, ( char* )buf, ( uint16_t )len );
                buf      = buf + len;
                rb.w_ptr = rb.w_ptr + len;
                len      = 0;
            }
            else {
                strncpy( rb.w_ptr, ( char* )buf,
                         ( uint16_t )( ( rb.r_ptr - 1 ) - rb.w_ptr ) );
                buf      = buf + ( ( rb.r_ptr - 1 ) - rb.w_ptr );
                len      = 0;
                rb.w_ptr = rb.r_ptr - 1;
            }
        }
    } while ( len != 0 );
}

// ============================================================================
static uint8_t cli_cmd_num_ = 0;
static void    CliRegisterCmd( char* str, CliHandle p ) {
    if ( cli_cmd_num_ < _CLI_CMD_MAX_NUM - 1 ) {
        cmd_list_[cli_cmd_num_].str = str;
        cmd_list_[cli_cmd_num_].p   = p;
        cli_cmd_num_++;
    }
    else {
        console.error(
            "Too many cli commands were registered. \r\nYou can "
            "increase it by defining _CLI_CMD_MAX_NUM in config.h\r\n" );
    }
}

// ============================================================================
static void consoleConfig( uint32_t baud_rate, uint8_t len, char parity,
                           uint8_t stop_b ) {

    console.level = LOG_INFO;
    rb.r_ptr      = rb.buffer;
    rb.w_ptr      = rb.buffer;

#if defined( _CONSOLE_USE_UART1_PA9PA10 )
    InitUSART1_PA9PA10( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART1_PB6PB7 )
    InitUSART1_PB6PB7( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART2_PA2PA3 )
    InitUSART2_PA2PA3( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART2_PD5PD6 )
    InitUSART2_PD5PD6( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART3_PB10PB11 )
    InitUSART3_PB10PB11( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART3_PC10PC11 )
    InitUSART3_PC10PC11( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART3_PD8PD9 )
    InitUSART3_PD8PD9( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART4_PC10PC11 )
    InitUART4_PC10PC11( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART5_PC12PD2 )
    InitUART5_PC12PD2( baud_rate, len, parity, stop_b );
#elif defined( _CONSOLE_USE_UART7_PE8PE7 )
    InitUART7_PE8PE7( baud_rate, len, parity, stop_b );
#else
#error consoleConfig(): not implemented!
#endif
    __HAL_UART_ENABLE( &hconsole_ );

    // command line interface -------------
    memset( &cli_, '\0', sizeof( cli_ ) );
    memset( cmd_list_, '\0', sizeof( cmd_list_[100] ) );
    cli_.out_message = "\r\n" CYN "1/3" NOC ": ";
    CliDeInit();

    // register some default commands -------------
    CliRegisterCmd( "help", ( CliHandle )CliShowCmd );
    CliRegisterCmd( "reset", ( CliHandle )CliReset );
    CliRegisterCmd( "log &level", ( CliHandle )CliLogSetLevel );
    CliRegisterCmd( "firmware", ( CliHandle )CliCheckFirmware );
    CliRegisterCmd( "scheduler &cmd", ( CliHandle )CliShowScheduler );

    console.enableRxen( true );
}

// ============================================================================
static void consoleTxMode( ConsoleTx_e tx ) {
    GPIO_InitTypeDef GPIO_InitStructure;
    if ( tx == TX_PP ) {
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    }
    else if ( tx == TX_OD ) {
        GPIO_InitStructure.Mode = GPIO_MODE_AF_OD;
    }
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
#if defined( _CONSOLE_USE_UART1_PA9PA10 )
    GPIO_InitStructure.Pin = GPIO_PIN_9;
    HAL_GPIO_Init( GPIOA, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART1_PB6PB7 )
    GPIO_InitStructure.Pin = GPIO_PIN_6;
    HAL_GPIO_Init( GPIOB, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART2_PA2PA3 )
    GPIO_InitStructure.Pin = GPIO_PIN_2;
    HAL_GPIO_Init( GPIOA, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART2_PD5PD6 )
    GPIO_InitStructure.Pin = GPIO_PIN_5;
    HAL_GPIO_Init( GPIOD, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART3_PB10PB11 )
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init( GPIOB, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART3_PC10PC11 )
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init( GPIOC, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART3_PD8PD9 )
    GPIO_InitStructure.Pin = GPIO_PIN_8;
    HAL_GPIO_Init( GPIOD, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART4_PC10PC11 )
    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init( GPIOC, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART5_PC12PD2 )
    GPIO_InitStructure.Pin = GPIO_PIN_12;
    HAL_GPIO_Init( GPIOC, &GPIO_InitStructure );
#elif defined( _CONSOLE_USE_UART7_PE8PE7 )
    GPIO_InitStructure.Pin = GPIO_PIN_8;
    HAL_GPIO_Init( GPIOE, &GPIO_InitStructure );
#else
#error console_TX_Mode(): not implemented!
#endif
}

// ============================================================================
static void consoleEnableRxen( bool enable ) {
    if ( enable ) {
        __HAL_UART_ENABLE_IT( &hconsole_, UART_IT_RXNE );
    }
    else {
        __HAL_UART_DISABLE_IT( &hconsole_, UART_IT_RXNE );
    }
}

// ============================================================================
// some values:
// \n: 0d10
// \r: 0d13
// keys:
// ENTER    : 0d13 (0x0D)
// ESC      : 0d27 (0x1B)
// Tab      : 0d09 (0x09)
// backspace: 0d127 (0x7F)
// space    : 0d32 (0x20)

// 0x1B then 0x5B:
// up arrow: 0d27, then 0d91 (0x1B, then 0x5B)
// down arrow: 0d27, then 0d91 (0x1B, then 0x5B), why it is the same as up
//             arrow?
// left/right arrows: the same
// home, end, page up, page down, delete

